{
  "</tool_call>": 151658,
  "<st>0": 151665,
  "<st>1": 151666,
  "<st>10": 151675,
  "<st>11": 151676,
  "<st>12": 151677,
  "<st>13": 151678,
  "<st>14": 151679,
  "<st>2": 151667,
  "<st>3": 151668,
  "<st>4": 151669,
  "<st>5": 151670,
  "<st>6": 151671,
  "<st>7": 151672,
  "<st>8": 151673,
  "<st>9": 151674,
  "<tool_call>": 151657,
  "<|box_end|>": 151649,
  "<|box_start|>": 151648,
  "<|endoftext|>": 151643,
  "<|file_sep|>": 151664,
  "<|fim_middle|>": 151660,
  "<|fim_pad|>": 151662,
  "<|fim_prefix|>": 151659,
  "<|fim_suffix|>": 151661,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644,
  "<|image_pad|>": 151655,
  "<|object_ref_end|>": 151647,
  "<|object_ref_start|>": 151646,
  "<|quad_end|>": 151651,
  "<|quad_start|>": 151650,
  "<|repo_name|>": 151663,
  "<|video_pad|>": 151656,
  "<|vision_end|>": 151653,
  "<|vision_pad|>": 151654,
  "<|vision_start|>": 151652
}
